tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/versions"
tap "caskroom/cask"
brew "fasd"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "neofetch"
brew "neovim"
brew "node"
brew "p7zip"
brew "pstree"
brew "python"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "zsh"
cask "alfred"
cask "authy-desktop"
cask "docker"
cask "firefoxdeveloperedition"
cask "signal"
cask "spotify"
cask "vlc"
cask "caskroom/versions/google-chrome-beta"
cask "caskroom/versions/iterm2-beta"
cask "caskroom/versions/slack-beta"
cask "caskroom/versions/virtualbox-beta"
