tap "crisidev/chunkwm"
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/versions"
tap "caskroom/cask"
cask "java"
# GNU database manager
brew "gdbm"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Command-line tool for DigitalOcean
brew "doctl"
# CLI tool for quick access to files and directories
brew "fasd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Java-based project management
brew "maven"
# Cross platform, open source .NET development framework
brew "mono"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Show ps output as a tree
brew "pstree"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Digital clock in ncurses
brew "tty-clock"
# Vi 'workalike' with many additional features
brew "vim", args: ["with-python@2"]
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
cask "alfred"
cask "authy"
cask "docker"
cask "dotnet"
cask "dotnet-sdk"
cask "macpass"
cask "mactex"
cask "microsoft-office"
cask "microsoft-teams"
cask "mono-mdk"
cask "rocket"
cask "signal"
cask "skype-for-business"
cask "spotify"
cask "virtualbox"
cask "vlc"
cask "caskroom/versions/firefox-developer-edition"
cask "caskroom/versions/google-chrome-beta"
cask "caskroom/versions/iterm2-beta"
cask "caskroom/versions/microsoft-remote-desktop-beta"
cask "caskroom/versions/slack-beta"
