bash
bzip2
certbot
cmake
coreutils
cryptsetup
device-mapper
dhcpcd
diffutils
docker
e2fsprogs
fasd
file
filesystem
findutils
gawk
gcc
gcc-libs
gettext
git
glibc
grep
grub
gzip
htop
inetutils
iproute2
iputils
jfsutils
jq
less
licenses
linux
logrotate
lsof
lvm2
make
man-db
man-pages
mdadm
nano
neofetch
neovim
netctl
netdata
openssh
pacman
pciutils
pcmciautils
perl
procps-ng
psmisc
python
python-neovim
python2-neovim
reiserfsprogs
ripgrep
s-nail
sed
shadow
sudo
sysfsutils
systemd-sysvcompat
tar
texinfo
tmux
tree
usbutils
util-linux
vi
vim
which
xfsprogs
zsh
